[
  {
    "id": 130664,
    "title": "If You’ve Been Banned From New World, Amazon Says It’s Your Fault",
    "short_description": "Apparently the lesson is don’t let other players bait you into saying things you shouldn’t.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/new-world-bans-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/new-world-bans.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/new-world-bans-709x418.jpg\" alt=\"New World Bans\" width=\"709\" height=\"418\" /></p>\r\n<p>If you’re concerned about the possibility of other New World players mass reporting you and getting you banned, you shouldn’t be – at least according to a <a title=\"New World Mass Report Forum Response\" href=\"https://forums.newworld.com/t/players-abusing-mass-report-to-ban-their-enemy-guildfaction/526306/2\" target=\"_blank\" rel=\"noopener\">CM's response on the game’s forums</a> yesterday. Community Manager NW_Mugsy responded to a recent thread in which players state that players “mass reporting” the enemy faction to have them banned prior to a territory-deciding conflict. According to Mugsy, “it shouldn’t matter how many reports” are received about a player if they haven’t broken the Code of Conduct as a human reviews the reports and bans based on behavior.</p>\r\n<p>In the post, the CM goes on to note that what is generally occurring is that two groups are baiting each other in attempts to get them to say something that is ban-worthy and then report each other. The increased number of reports only moves the reported individuals up in the review queue. The moderator does the rest of the work from there.</p>\r\n<p>Two caveats that were made in the post are that there may be some confusion with the ban notices being “too vague” and the banned individual just not remembering or realizing what they did, and that there are cases of “human error”. For the latter, it’s advised that players submit an appeal.</p>\r\n<p>This isn’t the only thing the New World team has addressed over the last day or so. The team has also dropped posts addressing changes designed to improve <a title=\"New World Combat Responsiveness\" href=\"https://forums.newworld.com/t/dev-blog-combat-responsiveness/526907\" target=\"_blank\" rel=\"noopener\">combat responsiveness</a>, the – still in the works – <a title=\"New World Server Transfers\" href=\"https://forums.newworld.com/t/megathread-gauging-interest-for-regional-server-transfer/526619/3\" target=\"_blank\" rel=\"noopener\">server transfers</a>, and <a title=\"New World Family Sharing\" href=\"https://forums.newworld.com/t/notice-family-sharing-update/509393\" target=\"_blank\" rel=\"noopener\">family sharing</a>. For the last, they’ve finally turned family sharing back on for those players who they determined used it as intended rather than for purposes such as gold farming, evading bans, and the like</p>",
    "article_url": "https://www.mmobomb.com/news/if-you-ve-been-banned-from-new-world-amazon-says-your-fault"
  },
  {
    "id": 130653,
    "title": "Overwatch's Cole Cassidy Gets New Comic And Story To Explain Renaming",
    "short_description": "The former Jesse McCree's \"New Blood\" challenge lasts until the 23rd.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/overwatch-cole-cassidy-new-blood-challenge-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/overwatch-cole-cassidy-new-blood-challenge.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/overwatch-cole-cassidy-new-blood-challenge-709x418.jpg\" alt=\"Overwatch Cole Cassidy New Blood Challenge\" width=\"709\" height=\"418\" /></p>\r\n<p>The very first Overwatch digital comic was titled \"<a href=\"https://playoverwatch.com/en-us/media/stories/train-hopper/\" target=\"_blank\" rel=\"noopener\">Train Hopper</a>\" and featured gunslinger Jesse McCree. That character has since been <a href=\"../news/overwatch-jesse-mccree-gets-new-name\" target=\"_blank\" rel=\"noopener\">renamed \"Cole Cassidy\"</a> due to the <a href=\"../news/activision-blizzard\" target=\"_blank\" rel=\"noopener\">ongoing sexual harassment issues swirling at Blizzard</a>, which has also prompted the company to rewrite the lore behind the character to explain the name change.</p>\r\n<p>That will all be explained in detail in a new digital comics series by Dark Horse titled, appropriately, \"New Blood.\" Written by Ray Fawkes and illustrated by Irene Koh, Deron Bennett, Suzanne Geary, the five-issue series will delve into Cassidy's search for a \"new crew\" and also explain the reasoning behind his new (or old) name.</p>\r\n<p>The description of the comic reads as follows:</p>\r\n<p><em>With chaos and devastation rife around the world, Cole Cassidy receives the call to rejoin Overwatch... but memories of its fall still haunt him. After an unexpected reunion with an old friend, Cassidy considers that maybe Overwatch needs more than the old crew to give it new life.</em></p>\r\n<p>The first chapter of the comic is available for free reading or downloading <a href=\"https://playoverwatch.com/en-us/media/stories/new-blood-1/\" target=\"_blank\" rel=\"noopener\">on the Overwatch site</a>, along with the first chapter of a text story, titled <a href=\"https://playoverwatch.com/en-us/media/stories/deadlock-rebels-chapter-1/\" target=\"_blank\" rel=\"noopener\">Deadlock Rebels</a>, which -- if you can judge a book by its cover -- seemes to cover the (mis)adventures of a young Cassidy and Ashe.</p>\r\n<p>Related to the comic is the in-game event is Cassidy's New Blood Challenge, which runs from today until November 23. It offers the usual slew of rewards, including a player icon, sprays, and the Sandstorm Cassidy skin. You can earn more rewards by watching selected Overwatch streamers on Twitch. Learn more about the challenge <a href=\"https://playoverwatch.com/en-us/cassidy-new-blood-challenge/\" target=\"_blank\" rel=\"noopener\">on the Overwatch site</a>.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/DHuOkoAtcA8\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"></iframe></p>",
    "article_url": "https://www.mmobomb.com/news/overwatch-cole-cassidy-gets-new-comic-game-event"
  },
  {
    "id": 130663,
    "title": "Blizzard To Open Season Of Mastery Name Reservations Soon",
    "short_description": "Grab your name for the Season launch on November 16.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/wow-classic-season-of-mastery-character-creation-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/wow-classic-season-of-mastery-character-creation.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/wow-classic-season-of-mastery-character-creation-709x418.jpg\" alt=\"WoW Classic Season Of Mastery Character Creation\" width=\"709\" height=\"418\" /></p>\r\n<p>Note: Activision Blizzard is still <a href=\"../news/activision-blizzard-sued-state-california-harassment-claims\">under investigation by the state of California for serious harassment charges</a>.</p>\r\n<p>The Season of Mastery will go live in World of Warcraft Classic, in just a week, on November 16. Players planning to take part will need to create a new character on one of the eight available servers and Blizzard is offering the opportunity to do so in advance. On November 11, players can select one of the servers listed in <a title=\"World of Warcraft Season of Mastery Character Creation Post\" href=\"https://us.forums.blizzard.com/en/wow/t/season-of-mastery-name-reservation-details/1130359\" target=\"_blank\" rel=\"noopener\">the post on the Blizzard forums</a> and reserve their name. There are, of course, some rules.</p>\r\n<p>The most important thing to keep in mind is that players will only be able to reserve a name for one character on their account. Of course, you’ll just go ahead and create your character at the same time, so it’s also important to keep in mind that if you decide you don’t like something about it, you’ll have to delete the character in question and start over. (Might just be a really good idea to make sure you’re happy before saving, so you don’t end up risking losing the name to someone else.)</p>\r\n<p>It’s also important to note that each of the eight available realms does have a player number cap and once it’s full, you’ll have to select another. If you know what server you want, don’t wait until the last minute to create your character.</p>",
    "article_url": "https://www.mmobomb.com/news/blizzard-to-open-season-of-mastery-name-reservations-soon"
  },
  {
    "id": 130662,
    "title": "Kakao Games Announces Second Beta Test For Sci-Fi Game Dysterra",
    "short_description": "Signups are available now if you have a passion for crafting.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/dysterra-beta-2-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/dysterra-beta-2.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/dysterra-beta-2-709x418.jpg\" alt=\"Dysterra Beta 2\" width=\"709\" height=\"418\" /></p>\r\n<p>On November 15, Kakao Games and developer Reality MagiQ will kick off the second beta test for their upcoming futuristic game Dysterra. Featuring a variety of game elements, Dysterra is a large-scale online survival crafting game in which players fight over a highly-desired mineral, Terrasite. Features of the game include building bases and obtaining landmarks in various regions that allow them to control the climate – meaning they can bring on their own natural disasters to mess with other players.</p>\r\n<p>Players also participate in FPS combat using both melee weapons and firearms. To obtain better weapons, they’ll also need to build research facilities to produce them, and they’ll definitely want the better weapons as Terrasite is not the only thing they’ll be fighting over. There are also valuable supply drops necessary to survival.</p>\r\n<p>As noted on Steam, Dysterra is still a work in progress and has no predicted launch date. That said, the game is listed on Steam and those wanting to participate in testing will need to <a title=\"Dysterra Steam Page\" href=\"https://store.steampowered.com/app/1527890/Dysterra/\" target=\"_blank\" rel=\"noopener\">request access via the game’s page</a>. The upcoming beta test will run for seven days, from November 15 to November 22.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/lgm65hAbpGk\" title=\"YouTube video player\" width=\"709\" height=\"418\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"></iframe></p>",
    "article_url": "https://www.mmobomb.com/news/kakao-games-announces-second-beta-test-sci-fi-game-dysterra"
  },
  {
    "id": 130661,
    "title": "Activision Blizzard Contractors Receive Pay Bump And Expanded Vacation Time",
    "short_description": "Still falls short of the norm in other countries.",
    "thumbnail": "https://www.mmobomb.com/file/2021/07/Blizzard-campus-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/07/Blizzard-campus.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/07/Blizzard-campus-768x428.jpg\" alt=\"Blizzard campus\" width=\"709\" height=\"418\" /></p>\r\n<p><em><strong>Note:</strong> Activision Blizzard is still <a href=\"../news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">under investigation by the state of California for serious harassment charges</a>.</em></p>\r\n<p>Score another \"W\" for workers at Activision Blizzard. A new series of measures aimed at improving the lot of contract workers have been enacted, according to a Twitter post by Senior Test Analyst Jessica Gonzalez:</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">Today ABK workers are celebrating a huge victory for our contract workers. This is a result of collective action and there is more work to do! 🙌🏻💙 <a href=\"https://t.co/PNJCTX0DbX\">pic.twitter.com/PNJCTX0DbX</a></p>\r\n— Jessica Gonzalez 💙 For the Alliance! (@BlizzJess) <a href=\"https://twitter.com/BlizzJess/status/1457888913394044937?ref_src=twsrc%5Etfw\">November 9, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>While these are commendable measures, especially given the usual \"replaceable\" nature of contract workers (think QA), the replies to Gonzalez's post indicate that they still fall short of the failsafes accorded workers in many other parts of the world -- or even in the U.S. for those belonging to a labor union.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">It's insane watching how bare minimum things are in the US. In Norway, we have legislated 20 days vacation no matter what, and if you're on tariff you have 25 days. Paid. Certain companies have 4x3 sick days a year. And some have up to 24 days of sick days a year. Unionize!!!</p>\r\n— Demiralos (@_demiralos) <a href=\"https://twitter.com/_demiralos/status/1458126296781934592?ref_src=twsrc%5Etfw\">November 9, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">Numbered sick days ... that's just sooooo wrong ... unbelievable. Is this normal in the US? When i had an accident i couldn't work for nearly 10 weeks. First 6 weeks were fully paid by my employer. After that insurance paid 90% net salary. (minus insurances)</p>\r\n— Chris Kilmar (@ChrisKilmar) <a href=\"https://twitter.com/ChrisKilmar/status/1458037697780535301?ref_src=twsrc%5Etfw\">November 9, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>Still, it's a step in the right direction, and one that -- if I'm being perfectly honest -- I'm surprised came through as well as it did. As Magicman is fond of saying, \"CEOs don't want to make most of the money, they want to make <em>all </em>of the money.\" Any concession on that front is nigh-miraculous and could open the door to further benefits down the road.</p>",
    "article_url": "https://www.mmobomb.com/news/activision-blizzard-contractors-receive-pay-bump-expanded-vacation-time"
  },
  {
    "id": 130660,
    "title": "Eve Online’s Fourth And Final Quadrant For 2021 Focuses On The Game’s Economy",
    "short_description": "Mining, compression, and resources all get love as the quadrant launched today.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/eve-online-4th-quadrant-2021-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/eve-online-4th-quadrant-2021.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/eve-online-4th-quadrant-2021-709x418.jpg\" alt=\"Eve Online 4th Quadrant 2021\" width=\"709\" height=\"418\" /></p>\r\n<p>All year long, CCP has been working on improving Eve Online’s ecosystem, working on various sections with updates known as Quadrants. Today, the company launched the fourth and final quadrant for 2021 – titled “New Dawn”. Each Quadrant focuses on improving something different in the game. For instance, when <a title=\"Eve Online Quadrant 3 Gateway\" href=\"../news/eve-online-quadrant-3-gateway-update-adds-new-new-player-experience\">Quadrant 3: Gateway</a> launched in September, it focused on improving the new and returning player experience – implementing things like tutorials on how to pilot ships. For the fourth Quadrant, CCP is focusing on improving the game’s economy with changes to mining, compression, and resources.</p>\r\n<p>As noted in the blog post on the Eve Online site, CCP has already done some work toward improving the distribution of resources in the game and even changed how ships relying on those resources to be made are manufactured. Now, New Dawn will increase resources throughout New Eden, updating the game’s mining system and rebalancing mining ships.</p>\r\n<p>The update doesn’t just concentrate on the economic aspect, however. It also adds four new exploration sites intended to reward those brave enough to venture into the most dangerous parts of space. Those willing to do so, and who manage to do so successfully, will fly away with capital and supercapital construction components. Obtaining these items will require players to explore three different AEGIS facilities and the Overmind Nursery Grove sites. Descriptions of each of these areas, as well as more details on the other changes, can be found on the <a title=\"Eve Online Quadrant 4 Blog Post\" href=\"https://www.eveonline.com/news/view/new-dawn-new-quadrant\" target=\"_blank\" rel=\"noopener\">Eve Online blog</a>.</p>",
    "article_url": "https://www.mmobomb.com/news/eve-online-fourth-final-quadrant-2021-focuses-game-economy"
  },
  {
    "id": 130659,
    "title": "Nexon's Q3 2021 Is Down From Pandemic-fueled 2020 Boost",
    "short_description": "Embark Studios tops financials, highlighting three projects in the works.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/embark-discovery-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/embark-discovery.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/embark-discovery-709x418.jpg\" alt=\"Embark Discovery\" width=\"709\" height=\"418\" /></p>\r\n<p>As is usually the case with all its financial reports, Nexon was happy with its Q3 2021 results, which saw the developer and publisher \"building momentum, strengthening our core business and preparing to launch several catalysts in 2022,\" according to President and CEO Owen Mahoney.</p>\r\n<p>That doesn't mean everything was up in the quarter; in fact, Q3 2021's revenue was down 4% from the record set in <a href=\"../news/nexon-best-ever-q3-expects-upward-trend-q4\">Q3 2020</a> -- not surprising, considering the \"pandemic boost\" most video game companies saw in the previous year. Mobile revenue, in particular, took a big hit, dropping 44% year-over-year. To make up for that \"PC revenues exceeded the expected range and mobile revenues came within the expected range\" -- we were <em>planning </em>to have a down quarter, you see?</p>\r\n<p>Most of the rest of the financials follow the usual trends we've seen from Nexon -- up here, down there, planning for a good Q4, etc. But perhaps the most surprising nugget of info is some slightly more tangible info about what Patrick Söderlund's Embark Studios is up to. You might recall that <a href=\"../news/nexon-fully-acquire-patrick-soderlunds-embark-studios\" target=\"_blank\" rel=\"noopener\">Nexon acquired</a> the former EA executive's Swedish studio two years ago, but we've heard little from the studio apart from a few high-level dev blogs <a href=\"../news/patrick-soderlunds-embark-studios-working-cooperative-f2p-action-game-set-distant-future\" target=\"_blank\" rel=\"noopener\">like this one</a>, that described its product as \"a cooperative free-to-play action game set in a distant future.\"</p>\r\n<p>The financial report includes pieces of art from three of \"Embark's New Games In Development.\" These fall under the temporary titles of \"Codename: Pioneer,\" \"Codename: Discovery,\" and something just called \"Creative Platform.\" In addition to the co-op F2P action game, we also know that Embark is working on a PvP shooter, <a href=\"https://medium.com/embarkstudios/our-continued-journey-89dad7a76bff\" target=\"_blank\" rel=\"noopener\">described on the company's site</a> as \"a concept that leans heavily into team-based gameplay and puts dynamism, physicality, and destruction front and center.\" I'd guess that's Discovery, while the earlier announced game is Pioneer.</p>\r\n<p>As for the company's \"Creative Platform,\" Embark's talked about that from time to time as well, with the previously linked blog piece comparing it to Roblox, Minecraft, Fortnite creative mode, and Rust. That blog was from late 2020, and there have been a slew of player-generated content games to show up since then, many utilizing some form of blockchain or NFTs. We haven't heard a proper update from Embark <a href=\"https://medium.com/embarkstudios/transforming-animation-with-machine-learning-27ac694590c\" target=\"_blank\" rel=\"noopener\">since February</a>, but we'd guess that some end-of-year update could be in the cards over the next few weeks.</p>\r\n<p>You can view Nexon's financials <a href=\"https://company.nexon.co.jp/en/press/index.html\" target=\"_blank\" rel=\"noopener\">via the company's investor relations page</a>.</p>",
    "article_url": "https://www.mmobomb.com/news/nexon-q3-2021-down-from-pandemic-fueled-2020-boost"
  },
  {
    "id": 130658,
    "title": "Get Wet 'n' Wild In PlanetSide 2's Next Update, Expedition: Oshur",
    "short_description": "First new continent in seven years adds water-based combat.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/planetside-2-oshur-key-art-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/planetside-2-oshur-key-art.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/planetside-2-oshur-key-art-709x418.jpg\" alt=\"PlanetSide 2 Oshur Key Art\" width=\"709\" height=\"418\" /></p>\r\n<p><a href=\"../review/planetside-2\" target=\"_blank\" rel=\"noopener\">PlanetSide 2</a> is getting new real estate for the game's three factions to fight over. Today, Rogue Planet Games announced Expedition: Oshur, an update coming next month that will add a new continent to the MMOFPS for the first time in seven years.</p>\r\n<p>Oshur will add a new wrinkle to PlanetSide 2, introducing water-based combat to the game in the form of surface and underwater battles. The \"full-featured water system\" will allow wheeled vehicles to \"putter along the water’s surface\" while \"treaded vehicles and infantry prowl the ocean floor.\" (Just make sure you rolled up the windows first.) Even some air vehicles can navigate underwater, though we'd guess that the super-huge <a href=\"../news/planetside-2s-february-update-adds-huge-fleet-carrier-airship\" target=\"_blank\" rel=\"noopener\">Bastion Fleet Carrier</a> isn't among them.</p>\r\n<p>On November 17, the nine-year anniversary of PS2's launch, Rogue Planet Games will show off a new two-part campaign with special, exclusive rewards. Oshur arrives in the game in December as part of that campaign. Learn more about the update in the <a href=\"https://www.planetside2.com/news/set-sail-for-oshur\" target=\"_blank\" rel=\"noopener\">dev letter on the PS2 site</a>.</p>",
    "article_url": "https://www.mmobomb.com/news/get-wet-n-wild-planetside-2-next-update-expedition-oshur"
  },
  {
    "id": 130657,
    "title": "Epic Games Pulls Travis Scott Emote From Fortnite ",
    "short_description": "The developer hasn’t specified why, although it does follow several deaths at one of the rapper’s concerts.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/fortnite-travis-scott-emote-removal-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/fortnite-travis-scott-emote-removal.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/fortnite-travis-scott-emote-removal-709x418.jpg\" alt=\"Fortnite Travis Scott Emote Removal\" width=\"709\" height=\"418\" /></p>\r\n<p>Following the events at the Travis Scott concert in Houston, Texas, Epic Games has removed the rapper’s “Out West” dance emote from the <a title=\"Fortnite Game Page\" href=\"../review/fortnite-battle-royale\">Fortnite</a> item shop. The company has <a title=\"IGN Travis Scott Fortnite\" href=\"https://www.ign.com/articles/travis-scott-fortnite-emote-disabled\" target=\"_blank\" rel=\"noopener\">declined to specify</a> whether or not these two events are related, although the timing does make it seem pretty likely.</p>\r\n<p>For those who may have missed the news, eight people – ranging in age from 14 to 27 – were killed, and at least 25 were injured, at the Astroworld concert this weekend when the audience surged toward the stage, effectively crushing those in front of them. Whether or not Scott was aware of what was happening is uncertain as the concert continued about a half an hour after deaths were declared. Although, he did stop it briefly when it came to his attention that someone in the audience had passed out.</p>\r\n<p>The concert took place on November 5. On November 7, Epic Games temporarily brought down the “Daily” section of the Item Shop and removed the emote in question. It’s suspected that the dance was due to be included in the upcoming rotation.</p>\r\n<p>The emote wasn’t Scott’s only tie-in to the game, as there are also two skins and additional cosmetics from the game’s first-ever concert event. As far as we know, these are still available in the game for now.</p>",
    "article_url": "https://www.mmobomb.com/news/epic-games-pulls-travis-scott-emote-from-fortnite"
  },
  {
    "id": 130656,
    "title": "Crowfall Adds Free 10-day Trial And Cuts Price To $14.99",
    "short_description": "Patch also makes small-scale PvP viable, for those \"who want to be able to play with their smaller guilds and not get obliterated.\"",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/crowfall-siege-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/crowfall-siege.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/crowfall-siege-709x418.jpg\" alt=\"Crowfall Siege\" width=\"709\" height=\"418\" /></p>\r\n<p>MMORPG Crowfall is getting a new price point and a free trial, developer ArtCraft <a href=\"https://crowfall.com/en-US/press\" target=\"_blank\" rel=\"noopener\">announced today</a>. Now anyone can try the game for free for 10 days and, if they like it, purchase the title at its new $14.99 price point. The game was priced at $39.99 at launch in July, which was itself a drop from a previously announced $49.99 price tag. Players who purchased the game up to 60 days before the price drop will receive 3,000 Crowns, the game's premium currency, as a bonus.</p>\r\n<p>The price drop arrives alongside a new patch that offers an enhanced new player experience and makes it easier for smaller guilds to be a factor in PvP. Guilds of 20-50 can now siege and hold forts without being overrun by bigger guilds, while guilds with 10-25 members can hold smaller outposts. Executive Producer Gordon Walton said that while Crowfall was designed with \"large-scale PVP siege combat as the focus ... there are other groups of players who want to be able to play with their smaller guilds and not get obliterated.\" Who knew?</p>\r\n<p>The patch also added several quality-of-life improvements, as well as the return of the \"Decapathon\" event, where players can sacrifice the heads of other players they defeat in PvP. Fun as that sounds, the rapid drops in price, along with the <a href=\"../news/crowfall-dev-artcraft-confirms-layoffs\" target=\"_blank\" rel=\"noopener\">recent layoffs</a> and the new free mode being implemented -- along with <a href=\"https://crowfall.com/en-US/news/articles/Crow-Recruits\" target=\"_blank\" rel=\"noopener\">greater bonuses to the recruiting program</a> -- to try and boost player numbers, lead me to think that it's Crowfall itself that might be getting its head chopped off soon.</p>",
    "article_url": "https://www.mmobomb.com/news/crowfall-adds-free-trail-cuts-price"
  },
  {
    "id": 130655,
    "title": "Chinese Team Edward Gaming Named League Of Legends World Champs",
    "short_description": "Over 4 million people watched the win.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/league-of-legends-world-championship-2021-winners-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/league-of-legends-world-championship-2021-winners.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/league-of-legends-world-championship-2021-winners-709x418.jpg\" alt=\"League Of Legends World Championship 2021 Winners\" width=\"709\" height=\"418\" /></p>\r\n<p>The <a title=\"League of Legends Game Page\" href=\"../review/league-of-legends\">League of Legends</a> World Championships have come to an end and the winners have been named. The last match came to a close on Saturday with more than 4 million viewers watching as <a title=\"MSN LoL WCS Winners\" href=\"https://www.msn.com/en-us/sports/more-sports/league-of-legends-champions-2021-heres-who-won-the-esports-competition-in-iceland/ar-AAQrMbZ\" target=\"_blank\" rel=\"noopener\">Team Edward took on DWG KIA</a>, beating them 3 to 2 in a best out of five. The second most-viewed match, at 3.5 million, was on day one of the event with DWG KIA taking on T1.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">🔥 4M Peak Viewers on <a href=\"https://twitter.com/hashtag/Worlds2021?src=hash&amp;ref_src=twsrc%5Etfw\">#Worlds2021</a>. <a href=\"https://twitter.com/EDG_Edward?ref_src=twsrc%5Etfw\">@EDG_Edward</a> vs <a href=\"https://twitter.com/DWGKIA?ref_src=twsrc%5Etfw\">@DWGKIA</a> is the most popular match of the event &amp; all-time record for <a href=\"https://twitter.com/hashtag/LoL?src=hash&amp;ref_src=twsrc%5Etfw\">#LoL</a>. Stats excl. Chinese platfoms. <br /><br />More viewership statistics of LoL Worlds 2021:<a href=\"https://t.co/9baZET1Xfe\">https://t.co/9baZET1Xfe</a> <a href=\"https://t.co/0LmtJS62F7\">pic.twitter.com/0LmtJS62F7</a></p>\r\n— Esports Charts (@EsportsCharts) <a href=\"https://twitter.com/EsportsCharts/status/1457058130068660225?ref_src=twsrc%5Etfw\">November 6, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>The win comes as a bit of a surprise as, apparently, this was the first time Team Edward had made it this far in the tournament and DWG had been doing incredibly well throughout. That said, fans were certainly celebrating in China where there are over 400 million esports fans.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">Meanwhile in China where there are over 400 million esports fans. <a href=\"https://t.co/jb0cgKKX0i\">https://t.co/jb0cgKKX0i</a> <a href=\"https://t.co/YvMvnQQ3cj\">pic.twitter.com/YvMvnQQ3cj</a></p>\r\n— Daniel Ahmad (@ZhugeEX) <a href=\"https://twitter.com/ZhugeEX/status/1457044913179201542?ref_src=twsrc%5Etfw\">November 6, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>Of course, Team Edward will be celebrating too as they <a title=\"Newsweek LoL WCS 2021 Prizes\" href=\"https://www.newsweek.com/league-legends-world-championship-winners-prize-money-1646379\" target=\"_blank\" rel=\"noopener\">walk away with $489,500</a> – plus championship rings. DWG didn’t do too badly in the monetary rewards area themselves, taking $333,750 in prize money.</p>",
    "article_url": "https://www.mmobomb.com/news/chinese-team-edward-gaming-named-league-of-legends-world-champs"
  },
  {
    "id": 130654,
    "title": " Cryptic Updates: Take Part In The Battle For Qo’nos Event In Star Trek Online, Item Unbind Comes To Neverwinter",
    "short_description": "Events expand and so will the unbinding possibilities.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/star-trek-online-battle-qo-39-nos-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/star-trek-online-battle-qo-39-nos.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/star-trek-online-battle-qo-39-nos-709x418.jpg\" alt=\"Star Trek Online Battle For Qo'noS\" width=\"709\" height=\"418\" /></p>\r\n<p>We have a double-news thing going on here. One each for fans of Cryptic’s MMOs <a title=\"Star Trek Online Game Page\" href=\"../review/star-trek-online\">Star Trek Online</a> and <a title=\"Neverwinter\" href=\"../review/neverwinter\">Neverwinter</a>. Beginning with STO, Cryptic is preparing for their next content release and, to get players ready, they’re hosting a special event from November 16 to December 7. <a title=\"Star Trek Online The Battle for Qo'noS\" href=\"https://www.arcgames.com/en/games/star-trek-online/news/detail/11501763-the-battle-for-qo'nos!\" target=\"_blank\" rel=\"noopener\">The Battle for Qo’noS event</a> is the final event for Campaign 3 and will offer players not only honor but also the chance at the new Console – Universal – Aakar’s Vengeance. It being the last part of Event Campaign 3 also means that it’s the last chance players will have to work toward the Tier 6 Infinity Promotion or Infinity Lock Box Ship.</p>\r\n<p>To earn progress, players will need to participate in one of three TFOs: Remain Klingon, To Hell with Honor, and Best Served Cold. Progress points are available for completing one TFO each day. Accumulating 14 points will earn players Aakar’s Vengeance, after which, players who continue to complete these three TFOs will be rewarded with Dilithium.</p>\r\n<p>In Neverwinter news, players can now <a title=\"Neverwinter Unbind Tokens\" href=\"https://www.arcgames.com/en/games/neverwinter/news/detail/11501733-unbind-tokens!\" target=\"_blank\" rel=\"noopener\">purchase Unbind Tokens</a> from the Zen Market. These have already been available in the game as a preview or as premium rewards over the last week and are used to unbind bound items. As noted in the post on the Neverwinter site, only a limited selection of items can currently be unbound, but the number will expand as time goes on. The number of tokens required to unbind an item will vary. If you want to do a little unbinding, check to see how many tokens you’re going to need first.</p>",
    "article_url": "https://www.mmobomb.com/news/take-part-battle-qo-nos-event-star-trek-online"
  },
  {
    "id": 130652,
    "title": "Halo Infinite Is Going To Have An Insanely Flexible Battlepass System",
    "short_description": "Players will never have to worry about losing what they pay for.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/halo-infinite-battle-pass-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/halo-infinite-battle-pass.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/halo-infinite-battle-pass-709x418.jpg\" alt=\"Halo Infinite Battle Pass\" width=\"709\" height=\"418\" /></p>\r\n<p>By this point in the battle pass life cycle, most gamers are used to the fact that when you pay for a battle pass, you have a limited time to get everything done or risk losing all those rewards. That system, along with things like loot boxes, aren’t exactly designed to benefit the player and often end up making players feel stressed and generally bad about something that should be a good time.</p>\r\n<p>As it turns out, 343 Industries seems to have the same feeling about both these methods of monetization and, while they are going to have battle passes, they’re definitely going to be different. The game won’t have loot boxes either...which should be a nice change. They recently <a title=\"IGN - Halo Infinite Battle Pass\" href=\"https://www.ign.com/articles/halo-infinite-multiplayer-battle-pass-season-one-plans\" target=\"_blank\" rel=\"noopener\">spoke to IGN</a> about their plans for Halo Infinite battle passes, and it sounds pretty nice – if they stick to it.</p>\r\n<p>Rather than having battle passes that expire when the next one comes out, 343 Industries will instead allow players to complete the battle passes at their leisure. Yes, new ones will come up and you’ll have to buy them each time, but once you have them, they’re yours and you can work on them as you please, with some stipulations. The biggest of these is that no matter how many battle passes you have that need working on, you can only do one at a time. However, you get to decide which one is active and you can switch whenever you like.</p>\r\n<p>In addition, approximately every quarter of the battle pass will offer a legendary cosmetic. Event rewards will not be tied to the battle pass. The game will also offer players cosmetic or customization options as rewards simply for playing the campaign and completing weekly challenges.</p>",
    "article_url": "https://www.mmobomb.com/news/halo-infinite-going-to-have-an-insanely-flexible-battlepass-system"
  },
  {
    "id": 130650,
    "title": "Play Gloria Victis Free For A Week During Their Free Trial Event",
    "short_description": "It’s also a bit of a stress test.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/gloria-victis-free-week-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/gloria-victis-free-week.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/gloria-victis-free-week-709x418.jpg\" alt=\"Gloria Victis Free Week\" width=\"709\" height=\"418\" /></p>\r\n<p>It looks like Black Eye Games is getting ready to bring their medieval open-world MMO Gloria Victis out of early access and into officially live status – more than five years after launching on Steam. To celebrate this milestone, and also give it a bit of a stress test, Black Eye Games is now <a title=\"Gloria Victis Free Week\" href=\"https://store.steampowered.com/news/app/327070/view/3070886183433614017\" target=\"_blank\" rel=\"noopener\">hosting the first-ever Gloria Victis free trial event</a>.</p>\r\n<p>The event is scheduled to last a full week, ending on November 15. Those interested can start playing now. Just click the “Request Access” button on Steam to download the game. If you decide you like the game and purchase it, all your progress from the free week will have been saved. You can pick up right where you left off. Also, note that they’re not limiting the content you have access to during the trial. You can try out all of the features available in Gloria Victis while you’re there.</p>",
    "article_url": "https://www.mmobomb.com/news/play-gloria-victis-free-week-during-their-free-trial-event"
  },
  {
    "id": 130649,
    "title": "Ubisoft Implements Pay Raises At Canadian Studios In Bid To Retain Key Talent",
    "short_description": "However, greater raises for senior staff spark further questions of inequality.",
    "thumbnail": "https://www.mmobomb.com/file/2021/11/ubisoft-far-cry-6-218x150.jpg",
    "main_image": "https://www.mmobomb.com/file/2021/11/ubisoft-far-cry-6.jpg",
    "article_content": "<p><img class=\"aligncenter size-large\" src=\"../file/2021/11/ubisoft-far-cry-6-709x418.jpg\" alt=\"Ubisoft Far Cry 6\" width=\"709\" height=\"418\" /></p>\r\n<p>Ubisoft, which has been under fire for over a year now due to claims of a toxic workplace and harassment at many of its worldwide studios, has taken a significant step to placate disgruntled workers. In doing so, however, the Far Cry and Assassin's Creed developer might have only created further discord among its staff members.</p>\r\n<p><a href=\"https://kotaku.com/ubisoft-announces-pay-raises-to-stop-developers-from-le-1848012438\" target=\"_blank\" rel=\"noopener\">Kotaku is reporting</a> that the company has implemented pay raises across the board at its Canadian studios, \"to combat an exodus by many of its most senior developers.\" The studios, based in Montreal, Quebec City, Toronto, Chicoutimi, Halifax, and Winnipeg, are responsible for the development of Ubisoft's biggest titles. The raises amount to 5% to 7% for junior staff, while those in more senior positions will receive up to a 20% increase. Employees will also receive more vacation days and better pay during parental leave.</p>\r\n<p>While appearing to be a generous gesture on the surface, the difference in pay rate has struck many, including the voices behind the A Better Ubisoft initiative, as less than satisfactory. \"By weighting the pay rises enormously in favor of senior staff, management are exacerbating the gap between the highly and low paid workers,\" a spokesperson for the group said, saying that the move does \"absolutely nothing\" to address their grievances, which were re-iterated late last week:</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"und\"><a href=\"https://twitter.com/hashtag/ABetterUbisoft?src=hash&amp;ref_src=twsrc%5Etfw\">#ABetterUbisoft</a> <a href=\"https://twitter.com/hashtag/EndAbuseInGaming?src=hash&amp;ref_src=twsrc%5Etfw\">#EndAbuseInGaming</a> <a href=\"https://t.co/KtcPHAWq57\">pic.twitter.com/KtcPHAWq57</a></p>\r\n— ABetterUbisoft (@ABetterUbisoft) <a href=\"https://twitter.com/ABetterUbisoft/status/1456579853222875145?ref_src=twsrc%5Etfw\">November 5, 2021</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>Ubisoft billed the changes as being prompted by the increased cost of living in Canada. It was the first time the company had made such a mid-year adjustment, which further lends credence to the notion that it's \"desperately trying to hold on to what few experienced devs are still here,\" as one dev in a Canadian studio put it.</p>",
    "article_url": "https://www.mmobomb.com/news/ubisoft-implements-pay-raises-montreal-studio-bid-to-retain-talent"
  }
]
